{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph, Node, Relationship,watch\n",
    "import json\n",
    "\n",
    "# watch(\"httpstream\")\n",
    "graph = Graph('http://neo4j:test@localhost:7474/db/data')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | t                                           \n",
       "---+----------------------------------------------\n",
       " 1 | (n20:Tag {name:\"01-januari\"})               \n",
       " 2 | (n431:Tag {name:\"Fortissimo_viko_zaal\"})    \n",
       " 3 | (n705:Tag {name:\"jpg\"})                     \n",
       " 4 | (n708:Tag {name:\"jpg-thunb\"})               \n",
       " 5 | (n983:Tag {name:\"shoot\"})                   \n",
       " 6 | (n1199:Tag {name:\"thumb\"})                  \n",
       " 7 | (n1:Tag {name:\"uitnodiging_5jaar_getrouwd\"})\n",
       " 8 | (n235:Tag {name:\"uitzoeken!\"})              \n",
       " 9 | (n982:Tag {name:\"verjaardag\"})              "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.cypher.execute('MATCH (t:Tag) RETURN t ORDER BY t.name')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "def get_tags():\n",
    "    query_result = graph.cypher.execute('MATCH (t:Tag) RETURN t ORDER BY t.name')\n",
    "    tags = []\n",
    "    for record in query_result:\n",
    "        tags.append({'name': record.t['name']})\n",
    "    return json.dumps(tags)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{\"name\": \"01-januari\"}, {\"name\": \"Fortissimo_viko_zaal\"}, {\"name\": \"jpg\"}, {\"name\": \"jpg-thunb\"}, {\"name\": \"shoot\"}, {\"name\": \"thumb\"}, {\"name\": \"uitnodiging_5jaar_getrouwd\"}, {\"name\": \"uitzoeken!\"}, {\"name\": \"verjaardag\"}]\n"
     ]
    }
   ],
   "source": [
    "print(get_tags())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6302.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6978.jpg\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"jpg\", \"thumb\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6743.jpg\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6946.jpg\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6311.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6892.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6907.JPG\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6384.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6917.JPG\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6393.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\"], \"fileName\": \"150321-IMG_6811.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"shoot\", \"verjaardag\", \"01-januari\"], \"fileName\": \"IMG_6130.JPG\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6256.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6739.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6821.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"verjaardag\", \"01-januari\", \"shoot\"], \"fileName\": \"IMG_6208.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6918.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"01-januari\", \"shoot\", \"verjaardag\"], \"fileName\": \"IMG_6177.JPG\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6265.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6748.JPG\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"shoot\", \"verjaardag\", \"01-januari\"], \"fileName\": \"IMG_6218.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\"], \"fileName\": \"150321-IMG_6936.jpg\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6366.JPG\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6339.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6845.JPG\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6375.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6857.JPG\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6348.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"jpg\", \"thumb\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6992.jpg\"}, {\"directory\": \"uitzoeken!\", \"tags\": [\"uitzoeken!\"], \"fileName\": \"IMG_6418.JPG\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6357.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\", \"thumb\"], \"fileName\": \"150321-IMG_7001.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"01-januari\", \"verjaardag\", \"shoot\"], \"fileName\": \"IMG_6069.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6748.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot/jpg\", \"tags\": [\"01-januari\", \"verjaardag\", \"shoot\", \"jpg\"], \"fileName\": \"150103-IMG_6155.jpg\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\", \"thumb\"], \"fileName\": \"150321-IMG_7010.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"verjaardag\", \"shoot\", \"01-januari\"], \"fileName\": \"IMG_6081.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\"], \"fileName\": \"150321-IMG_6760.jpg\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"thumb\", \"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_7059.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"01-januari\", \"verjaardag\", \"shoot\"], \"fileName\": \"IMG_6157.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6896.jpg\"}, {\"directory\": \"uitzoeken!\", \"tags\": [\"uitzoeken!\"], \"fileName\": \"IMG_6597.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6771.jpg\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6247.JPG\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"01-januari\", \"shoot\", \"verjaardag\"], \"fileName\": \"IMG_6199.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\"], \"fileName\": \"150321-IMG_6908.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"shoot\", \"verjaardag\", \"01-januari\"], \"fileName\": \"IMG_6166.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\"], \"fileName\": \"150321-IMG_6867.jpg\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6321.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6820.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6783.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6883.jpg\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6330.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6794.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6831.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6935.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"Fortissimo_viko_zaal\", \"thumb\", \"jpg\"], \"fileName\": \"150321-IMG_6951.jpg\"}, {\"directory\": \"uitzoeken!\", \"tags\": [\"uitzoeken!\"], \"fileName\": \"IMG_6409.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\", \"thumb\"], \"fileName\": \"150321-IMG_6961.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"shoot\", \"verjaardag\", \"01-januari\"], \"fileName\": \"IMG_6060.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"jpg\", \"thumb\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_7071.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"verjaardag\", \"shoot\", \"01-januari\"], \"fileName\": \"IMG_6139.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\", \"thumb\"], \"fileName\": \"150321-IMG_7040.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"01-januari\", \"verjaardag\", \"shoot\"], \"fileName\": \"IMG_6109.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\"], \"fileName\": \"150321-IMG_6832.jpg\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\", \"thumb\"], \"fileName\": \"150321-IMG_7049.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"01-januari\", \"verjaardag\", \"shoot\"], \"fileName\": \"IMG_6148.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6847.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"verjaardag\", \"shoot\", \"01-januari\"], \"fileName\": \"IMG_6118.JPG\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6274.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6760.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\"], \"fileName\": \"150321-IMG_6858.jpg\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6283.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6771.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\", \"thumb\"], \"fileName\": \"150321-IMG_6752.jpg\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6957.jpg\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6866.JPG\"}, {\"directory\": \"01-januari\", \"tags\": [\"01-januari\"], \"fileName\": \"IMG_6293.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"Fortissimo_viko_zaal\", \"jpg\"], \"fileName\": \"150321-IMG_6968.jpg\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6882.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"thumb\", \"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_7019.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"verjaardag\", \"01-januari\", \"shoot\"], \"fileName\": \"IMG_6091.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg/thumb\", \"tags\": [\"jpg\", \"thumb\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_7030.jpg\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"verjaardag\", \"shoot\", \"01-januari\"], \"fileName\": \"IMG_6100.JPG\"}, {\"directory\": \"uitzoeken!\", \"tags\": [\"uitzoeken!\"], \"fileName\": \"IMG_6578.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6783.jpg\"}, {\"directory\": \"Fortissimo_viko_zaal/jpg\", \"tags\": [\"jpg\", \"Fortissimo_viko_zaal\"], \"fileName\": \"150321-IMG_6796.jpg\"}, {\"directory\": \"uitzoeken!\", \"tags\": [\"uitzoeken!\"], \"fileName\": \"IMG_6588.JPG\"}, {\"directory\": \"01-januari/verjaardag/shoot\", \"tags\": [\"01-januari\", \"verjaardag\", \"shoot\"], \"fileName\": \"IMG_6186.JPG\"}, {\"directory\": \"Fortissimo_viko_zaal\", \"tags\": [\"Fortissimo_viko_zaal\"], \"fileName\": \"IMG_6810.JPG\"}]\n"
     ]
    }
   ],
   "source": [
    "query_partial = [\n",
    "'MATCH (p:Photo)',\n",
    "'WITH p',\n",
    "'MATCH (p)-[:HAS_TAG]->(t)',\n",
    "'WITH p, collect(t.name) as t',\n",
    "'WITH p,t, rand() as random',\n",
    "'RETURN p.fileName as fileName, p.directory as directory, t as tags',\n",
    "'LIMIT 90'\n",
    "];\n",
    "query_result = graph.cypher.execute('\\n'.join(query_partial))\n",
    "photos = []\n",
    "\n",
    "for record in query_result:\n",
    "    photos.append({'fileName': record.fileName, 'directory': record.directory, 'tags': record.tags})\n",
    "\n",
    "print json.dumps(photos)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
